package Week3;

public class RegExpTheory {
    /*
    1) Поиск текста:
    Текст: Java, java, java, program
    regexp: java
    Регулярные выражения регистрозависимые!

    2) Поиск любого символа:
    Текс:
    Аня
    Ася
    Оля
    Аля
    Валя

    А.я - начало на А, любой символ и окончание на я

    3)  Найти все файлы с расширением .txt:
        file.txt
        file1.txt
        file2.xls

        \.txt

     4) Поиск по набору символов
        Мы хотим найти имена Алла, Анна в списке.

            Анна
            Алла
            аоикА74арплт
            Аркан
            А^&а
            Абба


    */
}
